{"id":"EEE951F1-3C2D-47F7-B321-919831045BCA","projectName":"YelpReviewPolarityClassifier","description":"Yelp Review Polarity Dataset\n\nVersion 1, Updated 09\/09\/2015\n\nORIGIN\n\nThe Yelp reviews dataset consists of reviews from Yelp. It is extracted from the Yelp Dataset Challenge 2015 data. For more information, please refer to http:\/\/www.yelp.com\/dataset_challenge\n\nThe Yelp reviews polarity dataset is constructed by Xiang Zhang (xiang.zhang@nyu.edu) from the above dataset. It is first used as a text classification benchmark in the following paper: Xiang Zhang, Junbo Zhao, Yann LeCun. Character-level Convolutional Networks for Text Classification. Advances in Neural Information Processing Systems 28 (NIPS 2015).\n\n\nDESCRIPTION\n\nThe Yelp reviews polarity dataset is constructed by considering stars 1 and 2 negative, and 3 and 4 positive. For each polarity 280,000 training samples and 19,000 testing samples are taken randomly. In total there are 560,000 training samples and 38,000 testing samples. The negative polarity is class 1, and positive is class 2.\n\nThe files train.csv and test.csv contain all the training samples as comma-separated values. There are 2 columns in them, corresponding to class index (1 and 2) and review text. The review texts are escaped using double quotes (\"), and any internal double quote is escaped by 2 double quotes (\"\"). New lines are escaped by a backslash followed with an \"n\" character, that is \"\\n\".","version":"1.1","authorName":"Ming","createdDate":"2022-08-13T11:52:05Z","license":"MIT","activityEntities":["projectCreated",[{"id":"DE4AC972-F747-42D3-868E-E93EAE09ADC5","title":"Project Created","createdDate":"2022-08-13T11:52:05Z","event":"projectCreated","subtitle":"YelpReviewPolarityClassifier"}]],"taskType":"textClassifier","title":"Text Classification","location":"","versionErrorTitle":"Project file cannot be opened.","modifiedDate":"2022-08-13T11:52:05Z","settingsEntity":{"snapshotOnExtendTraining":true,"snapshotOnResumeTraining":false},"versionErrorSubtitle":"You need a newer version of Create ML to open this file. Download the latest version."}